//
// Created by isoul on 2021/6/13.
//

#include <stdio.h>
// 定义指针时必须带*，指针赋值时不用带*，取地址带&
int main() {
    int b = 100;
    int *p_b = &b;
    int a = 100;
    int *p_a = &a;
    char str[20] = "c.biancheng.net";
    // %d把对应的整数按有符号十进制输出，%u把对应的整数按无符号十进制输出，
    // 比如printf("%d,%u\n",-123,-123);，输出则是-123,4294967173
    // 因为-123的补码是11111111111111111111111110000101，
    // 在%u控制下把它当正数输出了。
    // 以带符号的十进制输出证书（正数不带符号）
    printf("%d\n", &a);
    // 以无符号十进制形式输出整数，负数把补码直接当作正数来算，所以和第一个不一样
    printf("%u\n", &a);
    // 以十六进制输出数据，如果输出不够8位，则左边补0
    printf("%p\n", &a);
    printf("%p\n", &p_a);
    // 以十六进制无符号形式输出整数，x是小写形式
    printf("%#X, %#X\n", &a, str);
    return 0;
}

// 学习网址：http://c.biancheng.net/view/1993.html
// 笔记：
// 9.1 整体对指针进行介绍。十六进制输出%#X，32位系统4G内存内存地址0x0-0xffffffff。
// 9.2 变量的定义和使用。指针初始化必加*，之后必不加，&取地址符号。指针比直接变量名获取消耗大。
// 9.3 指针变量的运算。几种输出形式。不能随意给普通变量的指针加加减减